acebearxp/ESP32/APP/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y

CONFIG_FREERTOS_USE_TRACE_FACILITY=y

CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_PINNED_TO_CORE_1=y

CONFIG_ESP_WIFI_TASK_PINNED_TO_CORE_0=y
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=n
CONFIG_LWIP_LOCAL_HOSTNAME="AceBear-ESP32S3"